data/google/gke/cpu/256/node-161/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     7466.28
    fsyncs/s:                     9558.88

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               116.66

General statistics:
    total time:                          10.0425s
    total number of events:              170856

Latency (ms):
         min:                                    0.02
         avg:                                    0.06
         max:                                   29.22
         95th percentile:                        0.07
         sum:                                 9963.82

Threads fairness:
    events (avg/stddev):           170856.0000/0.00
    execution time (avg/stddev):   9.9638/0.00